<font size="4"> 
<strong>"Importing the Pandas Library"</strong>
</font>

In [1]:
import pandas as pd

print('importing pandas')

importing pandas

In [2]:
# 2 main data types
car_model_series = pd.Series(["BMW", "Toyota", "Honda"])
car_model_series
# Series is 1-dimensional

0       BMW
1    Toyota
2     Honda
dtype: object

In [3]:
car_colours = pd.Series(['Red', 'Green', 'Blue'])
car_colours

0      Red
1    Green
2     Blue
dtype: object

In [4]:
# DataFrame = 2-Dimensional - more common thn a Series
car_data = pd.DataFrame({"CarMakeKey": car_model_series, "Car_Colour": car_colours})
# Now there is a Data Frame that is created by taking 2 Series and using 1 as the key and 2 as the value
car_data

  CarMakeKey Car_Colour
0        BMW        Red
1     Toyota      Green
2      Honda       Blue

In [5]:
# in Pandas, import a CSV file into a data frame instead of using series
car_sales = pd.read_csv("car-sales.csv")

In [6]:
car_sales

                               car-sales
Make   Colour Odometer Doors       Price
Toyota White  150043   4       $4,000.00
Honda  Red    87889    4       $5,000.00
Toyota Blue   32549    3       $7,000.00
BMW    Black  11179    5      $22,000.00
Nissan White  213095   4       $3,500.00
Toyota Green  99213    4       $4,500.00
Honda  Blue   45698    4       $7,500.00
              54738    4       $7,000.00
Toyota White  60000    4       $6,250.00
Nissan White  31600    4       $9,700.00

In [7]:
# Export the csv file a a newer file
car_sales.to_csv("car-sales-new.csv", index=False)

In [8]:
exported_car_sales = pd.read_csv("car-sales-new.csv")
exported_car_sales

     car-sales
0        Price
1    $4,000.00
2    $5,000.00
3    $7,000.00
4   $22,000.00
5    $3,500.00
6    $4,500.00
7    $7,500.00
8    $7,000.00
9    $6,250.00
10   $9,700.00

In [9]:
# Import Medical Data from a wensite URL
heart_data = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")
heart_data

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

## Describe Data

In [10]:
# Attribute
car_sales.dtypes

car-sales    object
dtype: object

In [11]:
# Attribute
car_sales.columns

Index(['car-sales'], dtype='object')

In [12]:
# Get a column from a DataFrame and return it as a new list 
car_columns = car_sales.columns
car_columns

Index(['car-sales'], dtype='object')

In [13]:
car_sales.index

MultiIndex([(  'Make', 'Colour', 'Odometer', 'Doors'),
            ('Toyota',  'White',   '150043',     '4'),
            ( 'Honda',    'Red',    '87889',     '4'),
            ('Toyota',   'Blue',    '32549',     '3'),
            (   'BMW',  'Black',    '11179',     '5'),
            ('Nissan',  'White',   '213095',     '4'),
            ('Toyota',  'Green',    '99213',     '4'),
            ( 'Honda',   'Blue',    '45698',     '4'),
            ( 'Honda',   'Blue',    '54738',     '4'),
            ('Toyota',  'White',    '60000',     '4'),
            ('Nissan',  'White',    '31600',     '4')],
           )

In [14]:
car_sales.describe()

        car-sales
count          11
unique         10
top     $7,000.00
freq            2

In [15]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 11 entries, ('Make', 'Colour', 'Odometer', 'Doors') to ('Nissan', 'White', '31600', '4')
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   car-sales  11 non-null     object
dtypes: object(1)
memory usage: 1.2+ KB

In [16]:
car_sales.mean(numeric_only=True)

Series([], dtype: float64)

In [17]:
car_prices = pd.Series([150, 600, 9854])
car_prices.mean(numeric_only = True)

np.float64(3534.6666666666665)